app/views/admin/books/index.html.erb

SELECT COUNT(*) FROM "books"
---
          <% if book.picture.present? %>
            <%= link_to image_tag(book.picture, size: Settings.admin.books.size),
              admin_books_path %>