app/views/comments/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  <li id="comment-<%= comment.id %>">
    <%= link_to image_tag(comment.user.avatar, size: Settings.users.size),
      comment.user %>