app/controllers/admin/books_controller.rb

  def index
    @books = Book.page(params[:page]).per Settings.admin.books.page
---
SELECT  "books".* FROM "books" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "books"

  def create
    @book = Book.new book_params
    if @book.save
---
INSERT INTO "books" ("title", "description", "publish_date", "author", "number_page", "category_id", "picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def load_category
    @categories = Category.all
---
SELECT "categories".* FROM "categories"