app/controllers/admin/categories_controller.rb

SELECT  "categories".* FROM "categories"  ORDER BY "categories"."created_at" DESC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.page(params[:page]).per(Settings.per_page).
      order created_at: :desc

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Ngon lu"], ["created_at", "2016-10-21 01:54:37.145170"], ["updated_at", "2016-10-21 01:54:37.145170"]]
---
  def create
    if @category.save