app/controllers/admin/requests_controller.rb

  def update
    @request = Request.find params[:id]
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 1]]