app/controllers/admin/requests_controller.rb

  def index
    @requests = Request.page(params[:page]).per Settings.admin.books.page
---
SELECT  "requests".* FROM "requests" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "requests"

  def update
    if @request.update_attributes status: Settings.accept_request
---
UPDATE "requests" SET "status" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["status", 2], ["updated_at", "2016-10-24 00:03:44.674283"], ["id", 1]]