app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 12 OFFSET 0
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" IN (1, 2)
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.includes(:reviews).page(params[:page]).per Settings.per_page

INSERT INTO "users" ("name", "email", "encrypted_password", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new user_params
    if @user.save

UPDATE "users" SET "encrypted_password" = ?, "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ? WHERE "users"."id" = ?
---
  def update
    if @user.update user_params