app/views/users/_favorite.html.erb

      <li class="list-group-item list-group-item-info">
        <%= link_to image_tag(favorite_book.picture, size: Settings.favorites.size,
          class: "book-image"), favorite_book %>
---
SELECT COUNT(*) FROM "books" WHERE 1=0