app/views/users/_like.html.erb

  <% if current_user.liked?(activity) %>
    <%= form_for current_user.likes.find_by(activity_id: activity.id),
      html: {method: :delete, remote: true} do |f| %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."activity_id" = ? LIMIT 1  [["user_id", 2], ["activity_id", 10]]