app/views/users/index.html.erb

SELECT COUNT(*) FROM "users"
---
            <td>
              <%= link_to image_tag(user.avatar, size: Settings.users.size), user %>