app/views/books/_book_home.html.erb

      <li><a href="#">Favorites & Reviews</a></li>
      <li><a href="#" ><%= book.favorites.count %>
        <span class="glyphicon glyphicon-heart"></span></a></li>
      <li><a href="#" class="icon fa-comment"><%= book.reviews.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]