app/views/books/_mini_book.html.erb

SELECT COUNT(*) FROM "books"
---
  </header>
  <%= link_to image_tag(book.picture, size: Settings.books.size), book, class: "image" %>