app/views/books/index.html.erb

        <%= search_form_for @q do |f| %>
          <%= f.select :category_id_eq,
            options_from_collection_for_select(Category.all, "id", "name", @q.category_id_eq), {include_blank: "All books"},
            class: "select-category", onchange: "this.form.submit()" %>
---
SELECT "categories".* FROM "categories"

        <% if book.picture.present? %>
          <%= link_to image_tag(book.picture, size: Settings.books.size), book, class: "book-image center" %>
---
SELECT COUNT(*) FROM "books"