app/controllers/books_controller.rb

SELECT  "books".* FROM "books" LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "books"
---
  def index
    @q = Book.search params[:q]
    @books = @q.result.page(params[:page]).per Settings.per_page

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  ORDER BY "reviews"."created_at" DESC LIMIT 5 OFFSET 0  [["book_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]
---
  def show
    @book = Book.find_by id: params[:id]
    @marks = Book.mark_book @book, current_user
    if @book.nil?
      flash[:danger] = t "books.show.error"
      redirect_to books_path
    else
      load_reviews
      @reviews = @book.reviews.order(created_at: :desc).includes(:comments).page(params[:page])
          .per Settings.reviews.page

SELECT "categories".* FROM "categories"
---
  def load_categories
    @categories = Category.all