app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.build comment_params
    @review = @comment.review
    if @comment.save
---
INSERT INTO "comments" ("content", "review_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "comment 1"], ["review_id", 2], ["user_id", 1], ["created_at", "2016-10-24 00:06:35.042233"], ["updated_at", "2016-10-24 00:06:35.042233"]]

  def destroy
    @comment = Comment.find(params[:id])
    #review = Review.find(@comment.review_id)
    if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]