app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.build comment_params
    @user = User.find_by id: @comment.user_id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]