app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 2], ["created_at", "2016-10-24 03:05:36.763362"], ["updated_at", "2016-10-24 03:05:36.763362"]]
---
  def create
    @book = Book.find_by id: params[:book_id]
    @book.favorites.create user: current_user