app/controllers/likes_controller.rb

INSERT INTO "activities" ("key", "trackable_id", "trackable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["key", "like.create"], ["trackable_id", 1], ["trackable_type", "Like"], ["created_at", "2016-10-24 04:32:27.689490"], ["updated_at", "2016-10-24 04:32:27.689490"]]
INSERT INTO "likes" ("activity_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["activity_id", 1], ["user_id", 1], ["created_at", "2016-10-24 04:32:27.685080"], ["updated_at", "2016-10-24 04:32:27.685080"]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    @like = current_user.likes.create activity_id: params[:activity_id]
    @activity = PublicActivity::Activity.find_by id: params[:activity_id]