app/controllers/marks_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    @book = Book.find_by id: params[:book_id]