app/controllers/relationships_controller.rb

  def index
    @user  = User.find_by id: params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

  def create
    @user = User.find params[:followed_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]