app/controllers/requests_controller.rb

INSERT INTO "requests" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["content", "ad xem quyen .... rat hay bla bla"], ["created_at", "2016-10-24 00:03:34.323699"], ["updated_at", "2016-10-24 00:03:34.323699"]]
---
  def create
    @request = Request.new request_params
    if @request.save

SELECT  "requests".* FROM "requests" WHERE "requests"."user_id" = ?  ORDER BY "requests"."created_at" DESC LIMIT 10 OFFSET 0  [["user_id", 2]]
SELECT COUNT(*) FROM "requests" WHERE "requests"."user_id" = ?  [["user_id", 2]]
---
  def load_requests
    @requests = (current_user.requests.order created_at: :desc)
      .page(params[:page]).per Settings.admin.books.page