app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "book_id", "content", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["book_id", 2], ["content", "abc"], ["rating", 5.0], ["created_at", "2016-10-24 03:05:45.775588"], ["updated_at", "2016-10-24 03:05:45.775588"]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 2]]
UPDATE "books" SET "rate_avg" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["rate_avg", 5.0], ["updated_at", "2016-10-24 03:05:45.822919"], ["id", 2]]
---
  def create
    @new_review = current_user.reviews.build review_params
    if @new_review.save
      book = @new_review.book
      book.rate_avg = book.reviews.average(:rating)
      book.save

UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 4.0], ["updated_at", "2016-10-24 03:10:33.197654"], ["id", 3]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]
UPDATE "books" SET "rate_avg" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["rate_avg", 2.0], ["updated_at", "2016-10-28 07:24:07.400346"], ["id", 1]]
---
  def update
    if @review.update_attributes review_params
      flash[:success] = t "reviews.messages.update_success"
      redirect_to @review.book
      book = @review.book
      book.rate_avg = book.reviews.average(:rating).round 2
      book.save