app/controllers/static_pages_controller.rb

  def home
    @books = Book.order("rate_avg DESC").includes(:favorites, :reviews).page params[:page]
    @mini_books = Book.random_book
    @reviews = Review.random_reviews.includes(:user, :book)
---
SELECT  "books".* FROM "books"  ORDER BY rate_avg DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "books"
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)