app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).per Settings.per_page
---
SELECT  "users".* FROM "users" LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @favorite_books = Book.where(id: Favorite.list_favorite(@user).pluck(:book_id))
      .page(params[:page]).per Settings.favorites.page
    @reading_books = Book.where(id: Mark.reading(@user).pluck(:book_id))
      .page(params[:page]).per Settings.favorites.page
    load_activities
    @top_reviews = @user.reviews.order("vote_count DESC").includes(:book)
      .page(params[:page]).per Settings.review.page
---
SELECT "favorites"."book_id" FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."id" = 1
SELECT COUNT(*) FROM "books" WHERE 1=0

  def update
    if @user.update user_params
---
UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ? WHERE "users"."id" = ?  [["avatar_file_name", "10891994_496455317159207_2493340638719748821_n.jpg"], ["avatar_file_size", 168406], ["avatar_updated_at", "2016-10-31 08:51:31.185795"], ["id", 1]]