app/views/admin/users/index.html.erb

        <td>
          <%= link_to image_tag(user.avatar, size: Settings.admin.users.size),
            admin_user_path(user) %>
---
SELECT COUNT(*) FROM "users"

        <td><%= link_to user.email,admin_user_path(user) %></td>
        <td><%= user.reviews.size %></td>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" IN (1, 2)
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]